<a href="https://colab.research.google.com/github/SarahLares/MD_Data_exploratory/blob/master/MD_Final_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
url_graduados = 'https://raw.githubusercontent.com/SarahLares/MD_Data_exploratory/master/graduados.csv'
url_estudiantes = 'https://raw.githubusercontent.com/SarahLares/MD_Data_exploratory/master/estudiantes.csv'
url_b = 'https://raw.githubusercontent.com/SarahLares/MD_Data_exploratory/master/carrera_52.csv'
url_n = 'https://raw.githubusercontent.com/SarahLares/MD_Data_exploratory/master/carrera_53.csv'

In [5]:
grad = pd.read_csv(url_graduados,delimiter=';')
grad

           id       Fecha                                 MENCION
0       33174  2015-06-19  LICENCIADO EN ESTUDIOS INTERNACIONALES
1       11614  2008-10-31                 LICENCIADO EN FILOSOFIA
2       85550  2018-07-27  LICENCIADO EN ESTUDIOS INTERNACIONALES
3       11686  2008-01-25                 LICENCIADO EN EDUCACION
4      141869  2008-11-28                                 ABOGADO
...       ...         ...                                     ...
44924   69482  2016-12-13                              ODONTOLOGO
44925  192248  2017-01-31              LICENCIADO EN FISIOTERAPIA
44926  194317  2018-11-30                 LICENCIADO EN EDUCACIÓN
44927   58429  2014-07-29                              ODONTOLOGO
44928   75921  2015-06-19  LICENCIADO EN ESTUDIOS INTERNACIONALES

[44929 rows x 3 columns]

In [6]:
est = pd.read_csv(url_estudiantes,delimiter=';')
est

            id letradi  tipodi_id  anoing    fechanac sexo
0          154       V          1    2000  1971-10-06    F
1          157       V          1    2001  1973-02-25    F
2          158       V          1    2000  1969-10-10    F
3          159       V          1    2000  1970-08-29    F
4          162       V          1    2000  1971-01-31    F
...        ...     ...        ...     ...         ...  ...
201370  201518       V          1    2019  1997-01-03    F
201371  201519       V          1    2019  1996-08-08    M
201372  201520       V          1    2019  1996-02-28    F
201373  184027       V          1    2019  1975-03-03    F
201374  201525       V          1    2019  1963-06-05    F

[201375 rows x 6 columns]

In [10]:
bio = pd.read_csv(url_b,delimiter=';')
bio.head()

   estudiante_id      codigo  ...   ano                   nombre.2
0           1116  0902003281  ...  2010  LICENCIADO EN BIOANÁLISIS
1          35654  0902003277  ...  2010  LICENCIADO EN BIOANÁLISIS
2           1116  0902003281  ...  2010  LICENCIADO EN BIOANÁLISIS
3          58302  0902003605  ...  2010  LICENCIADO EN BIOANÁLISIS
4           1591  0902003282  ...  2010  LICENCIADO EN BIOANÁLISIS

[5 rows x 12 columns]

In [11]:
nut = pd.read_csv(url_n,delimiter=';')
nut.head()

   estudiante_id     codigo  ...   ano                             nombre.2
0            743  904002475  ...  2010  LICENCIADO EN NUTRICIÓN Y DIETÉTICA
1          60392  904002477  ...  2010  LICENCIADO EN NUTRICIÓN Y DIETÉTICA
2            743  904002604  ...  2010  LICENCIADO EN NUTRICIÓN Y DIETÉTICA
3          60392  904002458  ...  2010  LICENCIADO EN NUTRICIÓN Y DIETÉTICA
4            743  904004001  ...  2010  LICENCIADO EN NUTRICIÓN Y DIETÉTICA

[5 rows x 12 columns]